# -*- encoding: utf-8 -*-
#require 'jcode'
# 全角カナ→半角カナ変換ユーティリティ

class Zen2Han
  HAN = [['ｧ'],['ｱ'],['ｨ'],['ｲ'],['ｩ'],['ｳ'],['ｪ'],['ｴ'],['ｫ'],['ｵ'],
         ['ｶ'],['ｷ'],['ｸ'],['ｹ'],['ｺ'],['ｻ'],['ｼ'],['ｽ'],['ｾ'],['ｿ'],
         ['ﾀ'],['ﾁ'],['ｯ'],['ﾂ'],['ﾃ'],['ﾄ'],['ﾅ'],['ﾆ'],['ﾇ'],['ﾈ'],['ﾉ'],
         ['ﾊ'],['ﾋ'],['ﾌ'],['ﾍ'],['ﾎ'],['ﾏ'],['ﾐ'],['ﾑ'],['ﾒ'],['ﾓ'],
         ['ｬ'],['ﾔ'],['ｭ'],['ﾕ'],['ｮ'],['ﾖ'],['ﾗ'],['ﾘ'],['ﾙ'],['ﾚ'],['ﾛ'],
         ['ﾜ'],['ｦ'],['ﾝ'],['ｰ'],['ﾞ'],['ﾟ'],
         ['ｶﾞ'],['ｷﾞ'],['ｸﾞ'],['ｹﾞ'],['ｺﾞ'],['ｻﾞ'],['ｼﾞ'],['ｽﾞ'],['ｾﾞ'],['ｿﾞ'],
         ['ﾀﾞ'],['ﾁﾞ'],['ﾂﾞ'],['ﾃﾞ'],['ﾄﾞ'],['ﾊﾞ'],['ﾋﾞ'],['ﾌﾞ'],['ﾍﾞ'],['ﾎﾞ'],
         ['ﾊﾟ'],['ﾋﾟ'],['ﾌﾟ'],['ﾍﾟ'],['ﾎﾟ'],['ｰ'],['ﾞ'],['ﾟ'],
         ['!'],['"'],['#'],['$'],['%'],['&'],["'"],['('],[')'],['*'],['+'],[','],
         ['-'],['.'],['/'],['0'],['1'],['2'],['3'],['4'],['5'],['6'],['7'],['8'],
         ['9'],[':'],[';'],['<'],['='],['>'],['?'],['@'],['A'],['B'],['C'],['D'],
         ['E'],['F'],['G'],['H'],['I'],['J'],['K'],['L'],['M'],['N'],['O'],['P'],
         ['Q'],['R'],['S'],['T'],['U'],['V'],['W'],['X'],['Y'],['Z'],['['],["\\"],
         [']'],['^'],['_'],['`'],['a'],['b'],['c'],['d'],['e'],['f'],['g'],['h'],
         ['i'],['j'],['k'],['l'],['m'],['n'],['o'],['p'],['q'],['r'],['s'],['t'],
         ['u'],['v'],['w'],['x'],['y'],['z'],['{'],['|'],['}'],['~'],[' ']]

  ZEN = 'ァアィイゥウェエォオカキクケコサシスセソタチッツテトナニヌネノハヒフヘホマミムメモャヤュユョヨラリルレロワヲンー゛゜ガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポー゛゜！”＃＄％＆’（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［￥］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝￣　'

  i = 0
  @@map = {}
  ZEN.each_char{|x|
    @@map[x] = HAN[i]
    i += 1
  }
  @@map2 = {}
  @@map.each{|k,v|
    @@map2[v.to_s] = k
  }
  def Zen2Han.map2
    @@map2
  end
  def Zen2Han.map
    @@map
  end
  def Zen2Han.toHan(str)
    result = ""
    str.to_s.each_char{|x| result += (@@map[x].blank? ? x : @@map[x][0])}
    return result
  end
  def Zen2Han.toZen(str)
    result = ""
    str.to_s.each_char{|x| result += (@@map2[x]||x).to_s}
    return result
  end
end


